//* Розгалуження: if, if...else, else...if
//TODO: 1 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.
// const str = 'abcde';
// if (str[0] === 'a') {
//   console.log('так');
// } else {
//   console.log('ні');
// }
// console.log(str.startsWith('a') ? 'так' : 'ні');
//TODO: 2 ===================================
// Написати скрипт, який перевіряє чи введене число через prompt потрапляє в діапазон від 55 до 99 включно.
// Якщо так, вивести в консоль "Число потрапляє в діапазон".
// Якщо ні, вивести в консоль "Число не потрапляє в діапазон".

// const num = 50;
// if (num >= 55 && num <= 99) {
//     console.log("Число потрапляє в діапазон");
// } else { console.log("Число не потрапляє в діапазон"); }

// console.log(num >= 55 && num <= 99 ? "Число потрапляє в діапазон" : "Число не потрапляє в діапазон");
//TODO: 3 ===================================
// Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100).
// До якої групи відноситься Максим, якщо йому 55 років.Назву групи вивести на екран.

// const ageMax = 0;

// if (ageMax >= 0 && ageMax <= 16) {
//     console.log("діти");
// }
// else if (ageMax >= 17 && ageMax <= 60) {
//     console.log("дорослі");
// }
// else if (ageMax >= 61 && ageMax <= 100) {
//     console.log("пенсіонери");
// }
// else {
//     console.log("помер");
// }

//TODO: 4 ===================================
//Напишіть цикл, який виводить у консоль
// числа від max до min за спаданням
// Додайте усі парні числа від min до max

// const min = 1;
// const max = 5;
// let sum = 0;

// for (let i = max; i > min; i--){
// 	if (i % 2 !== 0) {
// 		continue;
// 	}
// 	sum += i;
// 	console.log("Парні числа", i);
// }
// console.log(sum);


